>>SOURCE FORMAT IS FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. SIMPLE_CONTRACT RECURSIVE.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. BRIEF01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-OLD-COUNTER PIC S9(18) COMP-5 VALUE 0.

01  WS-COUNTER PIC S9(18) COMP-5 VALUE 0.

PROCEDURE DIVISION.
MAIN-LOGIC SECTION.
    * PRE-CONDITION: (counter < 10)
    IF NOT ((WS-COUNTER < 10))
        DISPLAY "BRIV CONTRACT FAILED: PRECONDITION: (counter < 10)"
        MOVE 4000 TO RETURN-CODE
        GOBACK
    END-IF.

    MOVE WS-COUNTER TO WS-OLD-COUNTER.

    ADD 1 TO WS-COUNTER.
    EXIT PARAGRAPH.
    * POST-CONDITION: (counter == (... + 1))
    IF NOT ((WS-COUNTER = (WS-OLD-COUNTER + 1)))
        DISPLAY "BRIV CONTRACT FAILED: POSTCONDITION: (counter == (... + 1))"
        MOVE 4000 TO RETURN-CODE
        GOBACK
    END-IF.

    GOBACK.

END PROGRAM SIMPLE_CONTRACT.
